zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca90/pic32cz2051ca90208-pinctrl.h
/* pd20m_gclk_io6 */
#define PD20M_GCLK_IO6 MCHP_PINMUX(d, 20, m, periph)

/* pd21_gpio */
#define PD21_GPIO MCHP_PINMUX(d, 21, gpio, gpio)

/* pd21a_eic_extint6 */
#define PD21A_EIC_EXTINT6 MCHP_PINMUX(d, 21, a, periph)

/* pd21e_ebi_d14 */
#define PD21E_EBI_D14 MCHP_PINMUX(d, 21, e, periph)

/* pd21k_eth_grx5 */
#define PD21K_ETH_GRX5 MCHP_PINMUX(d, 21, k, periph)

/* pd21m_gclk_io7 */
#define PD21M_GCLK_IO7 MCHP_PINMUX(d, 21, m, periph)

/* pd23_gpio */
#define PD23_GPIO MCHP_PINMUX(d, 23, gpio, gpio)

/* pd23a_eic_extint7 */
#define PD23A_EIC_EXTINT7 MCHP_PINMUX(d, 23, a, periph)

/* pd23e_ebi_d1 */
#define PD23E_EBI_D1 MCHP_PINMUX(d, 23, e, periph)

/* pd23f_tcc8_wo1 */
#define PD23F_TCC8_WO1 MCHP_PINMUX(d, 23, f, periph)

/* pd23h_can5_rx */
#define PD23H_CAN5_RX MCHP_PINMUX(d, 23, h, periph)

/* pd24_gpio */
#define PD24_GPIO MCHP_PINMUX(d, 24, gpio, gpio)

/* pd24a_eic_extint8 */
#define PD24A_EIC_EXTINT8 MCHP_PINMUX(d, 24, a, periph)

/* pd24d_sercom8_pad0 */
#define PD24D_SERCOM8_PAD0 MCHP_PINMUX(d, 24, d, periph)

/* pd25_gpio */
#define PD25_GPIO MCHP_PINMUX(d, 25, gpio, gpio)

/* pd25a_eic_extint9 */
#define PD25A_EIC_EXTINT9 MCHP_PINMUX(d, 25, a, periph)

/* pd25d_sercom8_pad1 */
#define PD25D_SERCOM8_PAD1 MCHP_PINMUX(d, 25, d, periph)

/* pd26_gpio */
#define PD26_GPIO MCHP_PINMUX(d, 26, gpio, gpio)

/* pd26a_eic_extint10 */
#define PD26A_EIC_EXTINT10 MCHP_PINMUX(d, 26, a, periph)

/* pd26d_sercom8_pad2 */
#define PD26D_SERCOM8_PAD2 MCHP_PINMUX(d, 26, d, periph)

/* pd26f_tcc2_wo0 */
#define PD26F_TCC2_WO0 MCHP_PINMUX(d, 26, f, periph)

/* pd27_gpio */
#define PD27_GPIO MCHP_PINMUX(d, 27, gpio, gpio)

/* pd27a_eic_extint11 */
#define PD27A_EIC_EXTINT11 MCHP_PINMUX(d, 27, a, periph)

/* pd27d_sercom8_pad3 */
#define PD27D_SERCOM8_PAD3 MCHP_PINMUX(d, 27, d, periph)

/* pd27f_tcc2_wo1 */
#define PD27F_TCC2_WO1 MCHP_PINMUX(d, 27, f, periph)

/* pd28_gpio */
#define PD28_GPIO MCHP_PINMUX(d, 28, gpio, gpio)

/* pd28a_eic_extint12 */
#define PD28A_EIC_EXTINT12 MCHP_PINMUX(d, 28, a, periph)

/* pd28d_sercom9_pad0 */
#define PD28D_SERCOM9_PAD0 MCHP_PINMUX(d, 28, d, periph)

/* pd28f_tcc2_wo2 */
#define PD28F_TCC2_WO2 MCHP_PINMUX(d, 28, f, periph)

/* pd29_gpio */
#define PD29_GPIO MCHP_PINMUX(d, 29, gpio, gpio)

/* pd29a_eic_extint13 */
#define PD29A_EIC_EXTINT13 MCHP_PINMUX(d, 29, a, periph)

/* pd29d_sercom9_pad1 */
#define PD29D_SERCOM9_PAD1 MCHP_PINMUX(d, 29, d, periph)

/* pd29f_tcc2_wo3 */
#define PD29F_TCC2_WO3 MCHP_PINMUX(d, 29, f, periph)

/* pe0_gpio */
#define PE0_GPIO MCHP_PINMUX(e, 0, gpio, gpio)

/* pe0a_eic_extint0 */
#define PE0A_EIC_EXTINT0 MCHP_PINMUX(e, 0, a, periph)

/* pe0j_spi_ixs1_sdo */
#define PE0J_SPI_IXS1_SDO MCHP_PINMUX(e, 0, j, periph)

/* pe1_gpio */
#define PE1_GPIO MCHP_PINMUX(e, 1, gpio, gpio)

/* pe1a_eic_extint1 */
#define PE1A_EIC_EXTINT1 MCHP_PINMUX(e, 1, a, periph)

/* pe1j_spi_ixs1_sck */
#define PE1J_SPI_IXS1_SCK MCHP_PINMUX(e, 1, j, periph)

/* pe2_gpio */
#define PE2_GPIO MCHP_PINMUX(e, 2, gpio, gpio)

/* pe2a_eic_extint2 */
#define PE2A_EIC_EXTINT2 MCHP_PINMUX(e, 2, a, periph)

/* pe2j_spi_ixs1_sdi */
#define PE2J_SPI_IXS1_SDI MCHP_PINMUX(e, 2, j, periph)

/* pe3_gpio */
#define PE3_GPIO MCHP_PINMUX(e, 3, gpio, gpio)

/* pe3a_eic_extint3 */
#define PE3A_EIC_EXTINT3 MCHP_PINMUX(e, 3, a, periph)

/* pe3b_adc0_ain9 */
#define PE3B_ADC0_AIN9 MCHP_PINMUX(e, 3, b, periph)

/* pe4_gpio */
#define PE4_GPIO MCHP_PINMUX(e, 4, gpio, gpio)

/* pe4a_eic_extint4 */
#define PE4A_EIC_EXTINT4 MCHP_PINMUX(e, 4, a, periph)

/* pe4d_sercom9_pad2 */
#define PE4D_SERCOM9_PAD2 MCHP_PINMUX(e, 4, d, periph)

/* pe4f_tcc2_wo4 */
#define PE4F_TCC2_WO4 MCHP_PINMUX(e, 4, f, periph)

/* pe5_gpio */
#define PE5_GPIO MCHP_PINMUX(e, 5, gpio, gpio)

/* pe5a_eic_extint5 */
#define PE5A_EIC_EXTINT5 MCHP_PINMUX(e, 5, a, periph)

/* pe5d_sercom9_pad3 */
#define PE5D_SERCOM9_PAD3 MCHP_PINMUX(e, 5, d, periph)

/* pe5f_tcc2_wo5 */
#define PE5F_TCC2_WO5 MCHP_PINMUX(e, 5, f, periph)

/* pe6_gpio */
#define PE6_GPIO MCHP_PINMUX(e, 6, gpio, gpio)

/* pe6a_eic_extint6 */
#define PE6A_EIC_EXTINT6 MCHP_PINMUX(e, 6, a, periph)

/* pe6b_adc0_ain10 */
#define PE6B_ADC0_AIN10 MCHP_PINMUX(e, 6, b, periph)

/* pe7_gpio */
#define PE7_GPIO MCHP_PINMUX(e, 7, gpio, gpio)

/* pe7a_eic_extint7 */
#define PE7A_EIC_EXTINT7 MCHP_PINMUX(e, 7, a, periph)

/* pe7b_adc0_ain11 */
#define PE7B_ADC0_AIN11 MCHP_PINMUX(e, 7, b, periph)

/* pe8_gpio */
#define PE8_GPIO MCHP_PINMUX(e, 8, gpio, gpio)

/* pe8a_eic_extint8 */
#define PE8A_EIC_EXTINT8 MCHP_PINMUX(e, 8, a, periph)

/* pe8b_adc0_ain12 */
#define PE8B_ADC0_AIN12 MCHP_PINMUX(e, 8, b, periph)

/* pe9_gpio */
#define PE9_GPIO MCHP_PINMUX(e, 9, gpio, gpio)

/* pe9a_eic_extint9 */
#define PE9A_EIC_EXTINT9 MCHP_PINMUX(e, 9, a, periph)

/* pe9b_adc0_ain13 */
#define PE9B_ADC0_AIN13 MCHP_PINMUX(e, 9, b, periph)

/* pe10_gpio */
#define PE10_GPIO MCHP_PINMUX(e, 10, gpio, gpio)

/* pe10a_eic_extint10 */
#define PE10A_EIC_EXTINT10 MCHP_PINMUX(e, 10, a, periph)

/* pe10b_adc0_ain14 */
#define PE10B_ADC0_AIN14 MCHP_PINMUX(e, 10, b, periph)

/* pe11_gpio */
#define PE11_GPIO MCHP_PINMUX(e, 11, gpio, gpio)

/* pe11a_eic_extint11 */
#define PE11A_EIC_EXTINT11 MCHP_PINMUX(e, 11, a, periph)

/* pe11b_adc0_ain15 */
#define PE11B_ADC0_AIN15 MCHP_PINMUX(e, 11, b, periph)

/* pf0_gpio */
#define PF0_GPIO MCHP_PINMUX(f, 0, gpio, gpio)

/* pf0a_eic_extint1 */
#define PF0A_EIC_EXTINT1 MCHP_PINMUX(f, 0, a, periph)

/* pf0p_ptc_drv30 */
#define PF0P_PTC_DRV30 MCHP_PINMUX(f, 0, p, periph)

/* pf1_gpio */
#define PF1_GPIO MCHP_PINMUX(f, 1, gpio, gpio)

/* pf1a_eic_extint1 */
#define PF1A_EIC_EXTINT1 MCHP_PINMUX(f, 1, a, periph)

/* pf1p_ptc_drv31 */
#define PF1P_PTC_DRV31 MCHP_PINMUX(f, 1, p, periph)

/* pf2_gpio */
#define PF2_GPIO MCHP_PINMUX(f, 2, gpio, gpio)

/* pf2a_eic_extint2 */
#define PF2A_EIC_EXTINT2 MCHP_PINMUX(f, 2, a, periph)

/* pf2p_ptc_drv29 */
#define PF2P_PTC_DRV29 MCHP_PINMUX(f, 2, p, periph)

/* pf3_gpio */
#define PF3_GPIO MCHP_PINMUX(f, 3, gpio, gpio)

/* pf3a_eic_extint3 */
#define PF3A_EIC_EXTINT3 MCHP_PINMUX(f, 3, a, periph)

/* pf3p_ptc_drv28 */
#define PF3P_PTC_DRV28 MCHP_PINMUX(f, 3, p, periph)

